<?php
// +----------------------------------------------------------------------
// | 深圳市保联科技有限公司
// +----------------------------------------------------------------------
// | Copyright (c) 2013-2017 http://www.luckyins.com All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: 黎小龙 <shalinglom@gmail.com>
// +----------------------------------------------------------------------

return [
    //当前环境 / 版本
    'version'    => env('SYSTEM_VERSION', false),

    //当前域名
    'domain'            => [
        'local'     => '*****',
        'dev'       => '*****',
        'product'   => '*****'
    ],

    'tokenValidTime'    => 60,              //token 有效时间 （分钟）

    //摇摇啦红包平台
    'yaoyaola'          => [
        'uid'           => '000',
        'apiKey'        => 'baolian_dlx',   // 加密密钥MD5()参数   登录摇摇啦后台设置
        'rate'          =>  0.02,           //红包手续费率
        'minAmount'     => 30,              // 红包最低金额
    ],

];